// Задание 1.
// Написать функцию, которая принимает один параметр - число, вычисляет сумму цифр и возвращает.
// Вызвать функцию для трех разных чисел.

// Задание 2.
// Написать функцию, которая принимает 3 числа и возвращает максимальное из них.
// Вызвать функцию, вывестт результат в консоль.

// Задание 3.
// Написать функцию, которая принимает два параметра - два слова и выводит в консоль то слово,
// которое длинее.

// Задание 4.
// Написать функцию, которая принимает два параметра: массив и число и возвращает элемент из массива
// с индексом заданным вторым параметром

// Задание 5.
// Написать функцию, которая принимает три параметра - три массива и возвращает один массив, 
// который состоит из элементов трех первых массивов в том порядке, в котором заданы параметры.
// Вызвать функцию, вывести результат в консоль

// Задание 6.
// Написать функцию, которая принимает два параметра массив и строку, которая может содержать 'number' или
// 'string' и возвращает массив элементов, которые являются или числами или строками, взависимости от
// того, что задано во втором параметре.

// Задание 7.
// Написать функцию, которая принимает один параметр - объект товар, который содержит название товара,
// цену, скидку, количество. Функция вычисляет сумму со скидкой и возвращает.
// Вызвать функцию и вывести результат в консоль.

// Задание 8.
// Написать функцию, котороя принимает три параметра a, b, c и решает квадратное уравнение.
// Вызвать функцию для разных значений параметров. 

// Задание 9.
// Написать функцию, которая принимает один параметра - диаметр круга и вычисляет его площадь. 
// Воспользоваться константой Math.PI

// Задание 10.
// Написать функцию, которая вычисляет площадь квадрата со стороной а, в который вписан круг диаметра а.
// Подказка: площадь круга надо отнять от площади квадрата.
