// Task 01
// 1. Установить Node.js
// 2. Установить редактор VSC

// Task 02
// Объявить переменную и сохранить значение 100.
// Вывести в консоль.
// Увеличить значение на 40 и снова вывести в консоль.
// Разделить значение на 2 и снова вывести в консоль.

// Task 03
// Объявить две переменных для хранения имени и фамилии, записать в них значения.
// Вывести значение переменных в консоль.

// Task 04
// Объявить две переменные и присвоить значения 3 и 5. 
// Вывести в консоль результат сравнения этих переменных. Должно быть false.

// Task 05
// Объявить переменную a со значением 1000. 
// Вычислить значение выражения используя декремент a = a - 1;
// Вывести в консоль.
// Вычислить значение выражения используя декремент a = a - 10;
// Вывести в консоль.

// Task 06
// Объявить переменную t со значением 20 > 10; Узнать тип значения переменной
// используя оператор typeof и вывести в консоль.

// Task 07
// Объявить переменную и присвоить ей значение 10. Вычислить остаток от деления на 2 (оператор %)
// и вывести в консоль.
// Увеличить значение переменной на 1. Вычислить остаток от деления на 2 и снова вывести в консоль.

// Task 08
// Объявить переменные a и b со значениями 34 и 23. Вычислить сумму и вывести в консоль

// Task 09
// Объявить переменные a и b со значениями '4' и 2. Вычислить сумму и вывести в консоль

// Task 10
// Объявить переменные a и b со значениями 'строка' и 2. Вычислить разницу и вывести в консоль

// Task 11
// Обяявить переменную v без зеачения и вывести ее в консоль.
