/**
 * Методы массивов
 * 1. includes(value, fromIndex) - проверяет, есть ли элемент в массиве из указанного индекса.
 * Например,
 * const a = [1, 2, 3];
 * a.includes(3) ==> true
 * a.includes(3, 10) ==> false
 * 
 * 2. reverse() - переставляет элементы в обратном порядке
 * Например,
 * const a = [1, 2, 3];
 * a.reverse() ==> [3, 2, 1]
 * 
 * 3. splice(startIndex, deleteCount) - удаляет указанного количество элементов с указанного индекса 
 * и возвращает их в новом массиве
 * Например,
 * const a = [1, 2, 3];
 * const b = a.splice(1, 1) ==> [1, 3];
 */
