// Задача 1
// Дан массив элементов [1, 2, 3, 4, 5]
// Проверить, содержит ли массив элемент, который вводит пользователь.
// Если содержит, то вывести "Да", иначе "Нет"

// Задача 2
// Создать два любых массива. Проверить содержит ли второй массив хотя бы один элемент из первого массива.

// Задача 3
// Создать два любых массива. Проверить содержит ли второй массив все элементы из первого массива.

// Задача 4
// Создать массив. Изменить порядок элементов в массиве на обратный и вывести массив.

// Задача 5
// Создать массив из четного количества элементов. Поменять местами элементы в каждой паре элементов.
// Например, [1, 2, 3, 4, 5, 6] => [2, 1, 4, 3, 6, 5]

// Задача 6
// Создать массив. Удадить из него элемент, который вводит пользователь.

// Задача 7
// Создать массив с дублями. Удалить из него все элементы, которые такие же как вводт пользователь.
// Например, [1, 2, 2, 3, 2, 5] и число 2 => [1, 3, 5]

// Задача 8
// Создать массив, который содержит числа и строки. Скопировать числа во второй массив. Из первого массива 
// числа удалить.

// Задача 9
// Создать массив строк. Строки, которые начинаются на букву 's' скопировать во второй массив.
// Строки, которые заканчиваются на 'y' или 'e' удалить из массива. 

// Задание 10
// Создать массив чисел. Удалить из него числа, которые больше 100.


