// Задание 1.
// Объявить массив, который содержит числа, строки и объекты.
// Используя forEach разложить числа в свой массив, строки в свой массив и объекты в свой массив.

// Задание 2.
// Написать функцию, которая принимает массив и элемент, который есть в этом массиве.
// Функция должна удалять этот элемент из массива и возвращать массив. Использовать filter

// Задание 3.
// Создать функцию, которая на вход принимает массив объктов товаров: название, цена, количество.
// Функция вычисляет сумму товара и возвращает. Использовать forEach

// Задание 4.
// Создать массив из чисел. Найти максимальное число в этом массиве. Использовать forEach.

// Задание 5.
// Создать массив строк. С помощью forEach создать второй массив, который будет содержать 
// количество гласных букв в каждом слове. Гласные буквы: a, o, i, e, u.
