// Задание 1.
// Пользователь вводит строку, которая состоит из цифр.
// Преобразовать эту строку в массив.
// Вывести в консоль все элементы массива

// Задание 2.
// Пользователь вводит строку, которая состоит из цифр.
// Преобразовать эту строку в массив.
// Подсчитать и вывести произведение цифр в массиве

// Задание 3.
// Пользователь вводит строку из 6 цифр.
// Преобразовать эту строку в массив.
// Подсчитать и вывести:
// - сумму первых трех элментов массива
// - сумму следующихй трех элементов массива
// - сумму четных элементов массива
// - сумму нечетных элементов массива

// Задание 4.
// Пользователь вводит строку, которая состоит из цифр.
// Преобразовать эту строку в массив.
// Найти максимальную цифру в массиве и вывести в консоль.


// Задание 5.
// Пользователь вводит строку, которая состоит из цифр.
// Преобразовать эту строку в массив.
// Найти индекс минимальной цифры в массиве.

// Задание 6.
// Пользователь вводит строку, которая состоит из цифр.
// Преобразовать эту строку в массив.
// Проверить идут ли цыфры по возрастанию, если да, вывести да, иначе нет.

// Задание 7.
// Пользователь вводит строку, которая состоит из цифр.
// Преобразовать эту строку в массив.
// Уменьшить каждый элемент массива на 10.
// Вывести массив в консоль.

// Задание 8.
// Пользователь вводит строку, которая состоит из цифр.
// Преобразовать эту строку в массив.
// Если элемент равняется 0, 1, 2, то увеличить его на 5.
// Если элемент равняется 3, 5, 7, 9, то уменьшить его на 3.
// Если элемент равняется 4, 6, 8, то разделить его на 2.
// Вывести массив в консоль.

// Задание 9.
// Пользователь вводит строку, которая состоит из цифр и букв.
// Преобразовать эту строку в массив.
// Подсчитать сумму цифр.

// Задание 10.
// Пользователь вводит строку, которая состоит из цифр и букв.
// Преобразовать эту строку в массив.
// Подсчитать количество гласных букв в массиве.

// Задача 11. Анализ строки или массива.
// Пользователь вводит строку, которая состоит из цифр и знаков + или - между ними.
// Например, '1+2-2+6-7+8-3'. Вычислить выражение, которое введет пользователь.

// Задача 12. Анализ строки или массива.
// Определить корректно ли расставлены скобки
