// Задание 1.
// Описать объекты, добавить минимум 5 полей: человек, автомобиль, дом, телефон, 
// компьютер, адрес

// Задание 2.
// Создать два объекта ребенок с полями имя и возраст. Вывести имя того ребенка,
// который старше.

// Задание 3.
// Создать объект товар с полями: название, описание, цена, количество, скидка.
// Вычислить сумму.
// Вычислить сумму со скидкой.

// Задание 4.
// Создать массив из трех объектов товар с разными значениями полей. 
// Объект товар описан выше.
// Создать второй массив и скопироать в него только назания товаров.


// Задание 5.
// Создать массив из трех объектов товар с разными значениями полей. 
// Объект товар описан выше.
// Подсчитать и вывести сумму всех товаров в массиве

// Задание 6.
// Создать массив из трех объектов товар с разными значениями полей. 
// Объект товар описан выше.
// Вывести название товара с минимальной ценой.

// Задание 7.
// Создать массив из трех объектов товар с разными значениями полей. 
// Объект товар описан выше.
// Вывести название товара с максимальной ценой.

// Задание 8.
// Создать массив из трех объектов товар с разными значениями полей. 
// Объект товар описан выше.
// Вывести товары, имена которых начинаются на букву, которую вводит пользователь.

// Задание 9.
// Создать массив из трех объектов товар с разными значениями полей. 
// Объект товар описан выше.
// Удалить из массива товар со скидкой 10.

// Задание 10.
// Создать массив из трех объектов товар с разными значениями полей. 
// Объект товар описан выше.
// Вывести в консоль 100, если в массиве есть товар с количеством 100, иначе вывести 0.
