/**
 * Некоторые методы строк
 * str.indexOf(searchValue[, fromIndex]) - возвращает индекс вхождения первого параметра в строку 
 *   или -1, если не находит
 * Можно задать второй параметр. Он определяет с какого индекса в строке необходимо начать поиск.
 * По умолчанию значение равно 0, тоесть поиск осуществляется с первого символа, но можно его делать 
 * с заданого индекса.
 * str.padEnd(targetLength [, padString]) - добавляет к строке с конца, символы указанные во 
 *   втором параметре, так, чтобы строка получилась длины, указанной в первом параметре
 * str.padStart(targetLength [, padString]) - добавляет к строке с начала, символы указанные во 
 *   втором параметре, так, чтобы строка получилась длины, указанной в первом параметре
 * str.replace(substr, newSubstr) - заменяет подстроку в первом параметре на второй парамтр один раз.
 * str.slice(beginIndex[, endIndex]) - возвращает подстроку начиная с индекса, указанного в первом 
 *   параметре до индекса указанного во втором параметре или до конца строки, если параметр не указан.
 */
