// Задание 10, 13, 14, 16 из предыдущей темы.

// Задание 1.
// Пользователь вводит две строки. Найти и вывести индекс второй строки в первой.

// Задание 2.
// Пользователь вводит две строки. Найти и вывести индекс второго вхождения второй строки в первую.
// Например, s1 = 'abcabc', s2 = 'ab', result = 3

// Задание 3.
// Пользователь вводит строку. Если строка больше 7 символов, то обрезать ее до 7 символов 
// и добавить в конец строки '...' так чтобы итоговая строка была 10 символов.
// Если строка меньше или равна 7 символам, то добавить столько симвлов '.', чтобы строка была 10
// символов
// Например, s1 = 'abcabcabcabc' => 'abcabca...', s2 = 'abc' => 'abc.......'

// Задание 4. 
// Пользователь вводит строку. Заменить все гласные буквы (a, e, i, o, u) на символ *.

// Задание 5.
// Пользователь вводит две строки. Найти количество вхождений второй строки в первую.

// Задание 6.
// Пользователь вводит строку. Создать две строки. Первую строку из четных символов, 
// вторую из нечетных символов и вывести их в консоль.

// Задание 7.
// Пользователь вводит строку, в которой повторяются подряд символы. Создать новую строку,
// где символы не повторяются.
// Например, s = 'aabcffjghhhf' => 'abcfjghf'

// Задание 8.
// Пользователь вводит строку и символ. Подсчитать количество таких символов в введенной строке.

// Задание 9.
// Пользователь вводит строку. Вывести перевернутую строку.
// Например s = 'abc' => 'cba'

// Задание 10.
// Пользователь вводит строку в которой есть символ *. Заменить символ * на ---.

// Задание 11.
// Пользователь вводит строку в которой есть символ *. Удалить этот символ из строки.



