// Задача 1
// Создать массив слов. Найти первый индекс слова в массиве, которое вводит пользователь.
// Записать этот индекс во второй массив. Вывести второй массив в консоль.

// Задача 2
// Создать массив слов. Найти последний индекс слова в массиве, которое вводит пользователь.
// Записать этот индекс во второй массив. Вывести второй массив в консоль.

// Задача 3
// Создать массив слов. Найти первый и последний индекс слова в массиве, которое вводит пользователь.
// Записать эти индексы во второй массив. Если эти индексы совпадают, вывести нет дублей, 
// иначе вывести есть дубли

// Задание 4
// Создать массив слов. Пользователь вводит слово. Найти индекс второго вхождения слова в массив.
// Например, a = ['zzz', 'xxx', 'zzz', 'zzz'], s = 'zzz', результат 2

// Задание 5
// Создать массив слов. Пользователь вводит слово. Найти индекс к-того вхождения слова в массив.

// Задание 6
// Создать массив слов. Пользователь вводит два числа. Скопировать во второй массив часть массива
// начиная с индекса = первое число и заканчивая инексом = второе число.

// Задание 7
// Создать массив слов с дублями. Пользователь вводит слово. Скопировать во товрой массив
// часть массива, которая начинается с индекса - первое вхождение слова и по индекс - последнее 
// вхождение слова.

// Задание 8
// Создать массив с дублями. На его основе создать второй массив без дублей.

// Задание 9
// Создать массив с числами и словами. Скопироать во второй массив часть массива начиная с первого числа
// и заканчивая последним числом.

// Задание 10
// Создать массив из 10 слов. Создать массив из 5 чисел от 0 до 9. Создать третий пустой массив.
// Из первого массива скопировать в третий массив все слова, начиная с каждого индекса, 
// который находится во втором массиве.
// Например
// a = ['a', 'b', 'c', 'd'], b = [3, 2, 2, 1, 0];
// c = ['d', 'c', 'd', 'c', 'd', 'b', 'c', 'd', 'a', 'b', 'c', 'd']
