// Task 01
// Вводиться три числа.
// Если первое число больше второго, а второе число больше третьего, то вывести третье число.

// Task 02
// Задание 5 из предыдущей темы переписать и применением оператора ||

// Task 03
// Дверной проем задается числами a, b. Вводяться в программу. 
// Узнать можно ли через этот проем пронести шкаф размерами c, d, e. Размеры вводяться в программу.

// Task 04
// Вводиться число a. Если оно принадлежит диапазону b, c, вывести в 
// консоль "Число а принадлежит диапазону [b, c]". Числа вводяться. 

// Task 05
// Ввести 3 числа. Проверить можно ли построить из этих чисел треугольник.
// Если можно, вывести "Да", иначе "Нет".

// Task 06
// В первом подъезде квартиры с 1 по 20. 
// Во втором с 21 по 48. 
// В третьем с 49 по 90. 
// Пользователь вводит номер квартиры. 
// Программа должна указать в каком подъезде находится данная квартира.
// Программа должна учитывать вариант ввода чисел за пределами диапазона 1..90.

// Task 07
// Вводяться три целых числа. Найти количество положительных чисел в исходном наборе.

// Task 08
// Вводяться три целых числа. Найти количество положительных и количество отрицательны
// чисел в исходном наборе.

// Task 09
// Даны три числа. Найти среднее из них (то есть число, расположенное между наименьшим и наибольшим).

// Task 10
// Даны три числа. Найти сумму двух наибольших из них.
