// Task 01. Деление числа на разряды
// Составить программу, которая будет считывать введённое пятизначное число. 
// После чего, каждую цифру этого числа необходимо вывести в новой строке.

// Task 02. Математическое выражение
// Запрограммировать следующее выражение: 
// (а + b — f / а) + f * a * a — (a + b) 
// Числа а, b, f вводятся.

// Task 03. Перевод числа из метров в километры
// Программа должна переводить число, введенное в метрах, в километры.

// Task 04. 
// Нарисовать програмно домик
//      /\ 
//     /  \ 
//    /    \ 
//   /------\ 
//  / |    | \ 
//    |    | 
//    |    | 
//    |____|

// Task 05. Прямоугольный треугольник
// Вводиться 3 числа. Проверить можно ли построить прямоугольный треугольник с этих чисел.
// Программа должна вывести: Да/Нет

// Task 06. Макс
// Вводиться 3 числа. Вывести максимальное из них.

// Task 07. Макс/Мин
// Вводиться 3 числа и строка max или min. 
// Если ввели max, программа выводит максимальночисло из трех введенных чисел.
// Если ввели min, программа выводит минимальное из трех введенных чисел.

// Task 08
// Составить алгоритм увеличения всех трех, введённых переменных на 5,
// если среди них есть хотя бы две равные. 
// В противном случае выдать ответ «равных нет».

// Task 09
// Вводиться два числа с разной четностью. Вывести нечетное число.

// Task 10
// Пользователь вводит целое число в диапазоне от 0 до 999.
//  Надо вывести сколько в этом числе цифр и положительное оно или отрицательное.

// Task 11
// Определить количество дней в году, который вводит пользователь.
// В высокосном годе - 366 дней, тогда как в обычном 365. 
// Высокосными годами являются все года делящиеся нацело на 4 за исключением столетий, 
// которые не делятся нацело на 400.

// Task 12
// Вводиться два числа
// Есть декартова система координат, в которой две перпендикулярные оси делят плоскость на четверти. 
// В первую четверть попадают точки, у которых обе координаты (x и y) больше нуля. 
// Во вторую: x < 0, y > 0; третью: x < 0, y < 0; четвертую: x > 0, y < 0.
// Написать программу, определяющую по координатам точки, в какой четверти она находится.
