// Задача 1
// Даны два массива: ['a', 'b', 'c'] и [1, 2, 3]. Объедините их вместе.
// Вывести результат в консоль.

// Задача 2
// Дан массив ['a', 'b', 'c']. Добавить ему в конец элементы 1, 2, 3.
// Вывести массив в консоль.

// Задача 3
// Дан массив [1, 2, 3]. Создать второй массив, 
// где элементы идут в обратном порядке [3, 2, 1].

// Задача 4
// Дан массив [1, 2, 3]. Добавить ему в начало элементы 4, 5, 6.

// Задача 5
// Дан массив ['js', 'css', 'jq']. Удалить из массива первый элемент
// и вывести его в консоль.

// Задача 6
// Дан массив ['js', 'css', 'jq']. Удалить последний элемент 
// и вывести его в консоль.

// Задача 7
// Дан массив [1, 2, 3, 4, 5]. Скопировать во второй массив первый и два последних элемента
// [1, 4, 5].

// Задача 8
// Даны массивы [1, 2, 3, 4, 5], ['a', 'b', 'c'] 
// Создайте третий массив [1, 2, 3, 'a', 'b', 'c', 4, 5].

// Задание 9
// Объявить два числовых массива по 10 элементов.
// Создать третий массив, который будет состоять из попарной суммы элементов первых двух массивов

// Задание 10
// Объявить массив слов из 5 слов.
// Создать второй массив, в который записать длину каждого слова.
// Подсчитать и вывести сумму элементов массива.

// Задание 11
// Объявить массив из 10 чисел.
// Создать новый массив, в который записать суммы двух сседних элементов из первого массива.

// Задание 12
// Объявить два массива строк по 5 элементов.
// Создать третий массив в который попеременно добавлять элемент из первого массива, 
// затем из второго и снова из первого и т.д.

// Задание 13
// Объявить два массива чисел по 5 элементов.
// Создать третий масив, в который добавлять попеременно элемент из первого массива, 
// последний элемент из второго массива, второй элемент из первого массива,
// предпоследний элемент из второго массива и т.д.

// Задание 14.
// Объявить массив из 10 чисел. Пользователь вводит число К от 2 до 5.
// Создать второй массив, в который записать сумму каждых К последовательных элементов.
// Например, 
// const a = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
// const k = 4;
// const b = [1+2+3+4, 2+3+4+5, 3+4+5+6, 4+5+6+7, 5+6+7+8, 6+7+8+9, 7+8+9+10]
