/**
 * Тема 3.
 *  1. var, let, const. 
 *  2. ==, ===
 */

// Значение переменных var, let можно изменять.
// Значение переменных const изменять нельзя.

// Переменные let, const доступны только с места, с которого они объявлены
// Недоступны выше.

// Переменные var доступны везде, но до объявления со значением undefined,
// после объявления с проинициализированным значением.

// Переменные let, const доступны только в блоке, где они объявлены, за пределами блока недоступны.

// Знак == не строгое равенство, не требует чтобы операнды были одного типа.
// Неявно происходит преобразование
// Знак === строгое равенство, требует чтобы операнды были одинакового типа.
