// Задача 1.
// Пользователь вводит строку, которая состоит из цифр больше чем 4 цифры.
// Преобразовать эту строку в массив.
// Скопировать первые 3 элемента во второй массив.
// Вывести первый и второй массив в консоль.

// Задача 2.
// Пользователь вводит строку, которая состоит из букв.
// Преобразовать эту строку в массив.
// Скопировать элементы с индексами с 2 по 5 во второй массив.
// Вывести первый и второй массив в консоль.

// Задача 3.
// Пользователь вводит строку, которая состоит из цифр больше чем 4 цифры.
// Преобразовать эту строку в массив.
// Скопировать элементы, которые деляться на 3 во второй массив.
// Вывести первый и второй массив в консоль.

// Задача 4.
// Пользователь вводит строку, которая состоит из цифр больше чем 4 цифры.
// Преобразовать эту строку в массив.
// Скопировать максимальный элемент во второй массив.
// Вывести первый и второй массив в консоль.

// Задача 5.
// Пользователь вводит строку, которая состоит из цифр больше чем 4 цифры.
// Преобразовать эту строку в массив.
// Скопировать минимальный и максимальный элементы во второй массив.
// Вывести первый и второй массив в консоль.

// Задача 6.
// Пользователь вводит строку, которая состоит из цифр больше чем 4 цифры.
// Преобразовать эту строку в массив.
// Скопировать все элементы, которые больше 2 и меньше 4 во второй массив.
// Вывести первый и второй массив в консоль.

// Задача 7.
// Пользователь вводит строку, которая состоит из цифр больше чем 4 цифры.
// Преобразовать эту строку в массив.
// Скопировать все элементы с четными индексами во второй массив.
// Найти сумму элементов во втором массиве.
// Вывести первый и второй массив в консоль, а также сумму.

// Задача 8.
// Пользователь вводит строку, которая состоит из букв.
// Преобразовать эту строку в массив.
// Скопировать все элементы, которые есть гласными буквами во второй массив.
// Вывести первый и второй массив в консоль.

// Задача 9.
// Объявить массив const a = ['abc', 'vbnc', 'tytujj', 'cvb'].
// Создать второй масиив, который будет содержать длину строк массива a.
// Вывести первый и второй массив в консоль.

// Задача 10.
// Объявить массив const a = ['abc', 2, 3, true].
// Создать второй масиив, который будет содержать только числа первого массива.
// Вывести первый и второй массив в консоль.
